Revit 2026 API

# MEPBuildingConstructionSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPBuildingConstructionSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
MEPBuildingConstructionSetIterator()
```
```fsharp
new : unit -> MEPBuildingConstructionSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

MEPBuildingConstructionSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace